{
  "fecha_creacion_vs_emision": {
    "valor": 15,
    "descripcion": "Diferencia entre la fecha de creación del PDF y la fecha de emisión del documento",
    "explicacion": "Un documento legítimo debería crearse cerca de su fecha de emisión. Diferencias grandes pueden indicar manipulación."
  },
  "fecha_mod_vs_creacion": {
    "valor": 12,
    "descripcion": "Diferencia entre la fecha de modificación y creación del PDF",
    "explicacion": "Modificaciones posteriores a la creación pueden sugerir alteraciones del documento original."
  },
  "software_conocido": {
    "valor": 12,
    "descripcion": "Uso de software conocido y confiable para crear el PDF",
    "explicacion": "Documentos creados con software desconocido o poco común pueden ser sospechosos."
  },
  "num_paginas": {
    "valor": 10,
    "descripcion": "Número de páginas esperado para el tipo de documento",
    "explicacion": "Facturas típicamente tienen una página. Múltiples páginas pueden indicar manipulación o complejidad inusual."
  },
  "capas_multiples": {
    "valor": 10,
    "descripcion": "Presencia de capas múltiples (OCG) en el PDF",
    "explicacion": "Las capas pueden usarse para ocultar o superponer información, común en documentos manipulados."
  },
  "consistencia_fuentes": {
    "valor": 8,
    "descripcion": "Consistencia en el uso de fuentes tipográficas",
    "explicacion": "Mezcla excesiva de fuentes puede indicar que el documento fue compuesto de múltiples fuentes."
  },
  "dpi_uniforme": {
    "valor": 8,
    "descripcion": "Uniformidad en la resolución (DPI) de las imágenes",
    "explicacion": "Resoluciones muy diferentes pueden indicar inserción de imágenes de distintas fuentes."
  },
  "compresion_estandar": {
    "valor": 6,
    "descripcion": "Uso de métodos de compresión estándar",
    "explicacion": "Métodos de compresión inusuales pueden indicar manipulación o generación no estándar."
  },
  "alineacion_texto": {
    "valor": 6,
    "descripcion": "Alineación correcta de elementos de texto",
    "explicacion": "Texto mal alineado o con rotaciones extrañas puede indicar manipulación digital."
  },
  "anotaciones_o_formularios": {
    "valor": 3,
    "descripcion": "Presencia de anotaciones o campos de formulario",
    "explicacion": "Elementos interactivos en documentos oficiales pueden facilitar la manipulación."
  },
  "javascript_embebido": {
    "valor": 2,
    "descripcion": "Código JavaScript embebido en el PDF",
    "explicacion": "JavaScript en documentos oficiales es inusual y puede usarse para ocultar contenido."
  },
  "archivos_incrustados": {
    "valor": 3,
    "descripcion": "Archivos adjuntos o incrustados en el PDF",
    "explicacion": "Archivos ocultos dentro del PDF pueden contener información maliciosa o no autorizada."
  },
  "firmas_pdf": {
    "valor": 4,
    "descripcion": "Presencia de firmas digitales válidas",
    "explicacion": "Las firmas digitales aumentan la confiabilidad del documento (reduce el riesgo)."
  },
  "actualizaciones_incrementales": {
    "valor": 3,
    "descripcion": "Múltiples actualizaciones incrementales del PDF",
    "explicacion": "Muchas modificaciones pueden indicar alteraciones sucesivas del documento original."
  },
  "cifrado_permisos_extra": {
    "valor": 2,
    "descripcion": "Cifrado o permisos especiales aplicados",
    "explicacion": "Restricciones inusuales pueden usarse para ocultar el método de creación del documento."
  },
  "math_consistency": {
    "valor": 10,
    "descripcion": "Consistencia aritmética y validación financiera completa",
    "explicacion": "Validación de coherencia en cálculos (subtotal + IVA - descuentos = total), items individuales, porcentajes de impuestos y detección de anomalías financieras. Errores matemáticos pueden indicar manipulación."
  },
  "sri_verificacion": {
    "valor": 20,
    "descripcion": "Verificación exitosa contra el SRI (Servicio de Rentas Internas)",
    "explicacion": "La capacidad de verificar el documento contra registros oficiales del SRI aumenta significativamente la confiabilidad."
  },
  "extraccion_texto_ocr": {
    "valor": 30,
    "descripcion": "Extracción de texto mediante OCR (Reconocimiento Óptico de Caracteres)",
    "explicacion": "La incapacidad de extraer texto legible de una imagen puede indicar manipulación, baja calidad o formato no estándar."
  },
  "campos_criticos_factura": {
    "valor": 40,
    "descripcion": "Presencia de campos críticos de factura (RUC, Razón Social, Fecha, Total)",
    "explicacion": "La ausencia de campos esenciales de facturación puede indicar que la imagen no es una factura legítima o que ha sido manipulada."
  },
  "clave_acceso_sri": {
    "valor": 20,
    "descripcion": "Presencia de clave de acceso SRI válida",
    "explicacion": "Sin clave de acceso SRI no se puede validar la autenticidad del documento contra registros oficiales."
  },
  "doble_compresion_detectada": {
    "valor": 15,
    "descripcion": "Detección de doble compresión en imagen JPEG",
    "explicacion": "La compresión múltiple puede indicar que la imagen fue editada y re-guardada, sugiriendo manipulación."
  },
  "inconsistencias_ruido_bordes": {
    "valor": 18,
    "descripcion": "Inconsistencias en patrones de ruido y bordes",
    "explicacion": "Patrones de ruido inconsistentes pueden indicar edición local, clonado o pegado de elementos."
  },
  "analisis_ela_sospechoso": {
    "valor": 12,
    "descripcion": "Análisis ELA (Error Level Analysis) sospechoso",
    "explicacion": "El ELA detecta áreas de la imagen que han sido editadas o re-comprimidas, indicando posible manipulación."
  },
  "analisis_phash_sospechoso": {
    "valor": 10,
    "descripcion": "Análisis de hash perceptual (pHash) sospechoso",
    "explicacion": "Diferencias significativas en hash perceptual por bloques pueden indicar edición local o pegado de elementos."
  },
  "analisis_ssim_sospechoso": {
    "valor": 8,
    "descripcion": "Análisis SSIM (Structural Similarity Index) regional sospechoso",
    "explicacion": "Baja similitud estructural entre regiones puede indicar áreas editadas o elementos pegados."
  },
  "metadatos_sospechosos": {
    "valor": 5,
    "descripcion": "Metadatos EXIF/IPTC/XMP sospechosos o inconsistentes",
    "explicacion": "Metadatos faltantes, inconsistentes o con información sospechosa pueden indicar manipulación."
  },
  "texto_superpuesto": {
    "valor": 25,
    "descripcion": "Detección de texto superpuesto en imagen",
    "explicacion": "Texto superpuesto puede indicar que se agregó información sobre el documento original."
  },
  "capas_ocultas": {
    "valor": 20,
    "descripcion": "Presencia de capas ocultas en formatos que las soportan",
    "explicacion": "Capas ocultas pueden contener información no visible que modifica el contenido aparente del documento."
  },
  "evidencias_forenses": {
    "valor": 15,
    "descripcion": "Evidencias forenses generales de manipulación",
    "explicacion": "Indicadores técnicos que sugieren que la imagen ha sido modificada o manipulada digitalmente."
  },
  "inconsistencia_financiera_items_subtotal": {
    "valor": 25,
    "descripcion": "Inconsistencia entre suma de ítems y subtotal sin impuestos",
    "explicacion": "La suma de los ítems individuales debe coincidir con el subtotal sin impuestos. Una diferencia indica posible manipulación de totales."
  },
  "inconsistencia_financiera_total_recompuesto": {
    "valor": 30,
    "descripcion": "Inconsistencia entre total recompuesto y total declarado",
    "explicacion": "El total calculado (subtotal + impuestos - descuentos) debe coincidir con el total declarado. Una diferencia indica manipulación financiera."
  },
  "categoria_primaria_max": {
    "valor": 5,
    "descripcion": "Penalización máxima para categoría Primaria",
    "explicacion": "Límite superior de puntos de penalización para elementos de alta prioridad en el análisis forense."
  },
  "categoria_secundaria_max": {
    "valor": 5,
    "descripcion": "Penalización máxima para categoría Secundaria",
    "explicacion": "Límite superior de puntos de penalización para elementos de prioridad media en el análisis forense."
  },
  "categoria_adicional_max": {
    "valor": 5,
    "descripcion": "Penalización máxima para categoría Adicional",
    "explicacion": "Límite superior de puntos de penalización para elementos de prioridad baja en el análisis forense."
  }
}
